app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ' DASDFASDF'
---
  def similar
      @movie = Movie.find(params[:id])

      if @movie
        if @movie.director == nil or @movie.director == ""
          session[:noDirector] = @movie.title
          redirect_to movies_path
      else
        @sameDirectorMovies = Movie.find_all_by_director(@movie.director)